Tekla Open API Reference for Tekla Structures 2025
Localization.Util Class
 The Util class contains general localizers for different kinds of controls.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Dialog.Localization.Util
 Namespace: Tekla.Structures.Dialog
 Assembly: Tekla.Structures.Dialog (in Tekla.Structures.Dialog.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public class Util
Public Class Util
The Localization.Util type exposes the following members.
Constructors
Name | Description
Localization.Util
Initializes a new instance of the Localization.Util class
Top
Methods
Name | Description
LocalizeDataGridView
 Localizes a DataGridView.
LocalizeImageListComboBox
 Localizes an ImageListComboBox.
LocalizeListControl
 Localizes a List control.
LocalizeToolStrip
 Localizes a ToolStrip.
Top
See Also
Reference
Tekla.Structures.Dialog Namespace